ycsb/logs/RDMA_BP_16_async_th_28/workloadb.log
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
[...]
total zerocopy send size = 0, total send size = 22686235, 0.000000
[OVERALL], RunTime(ms), 5608
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17831.66904422254
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95069
[READ], AverageLatency(us), 51.79269793518392
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 5467
[READ], 95thPercentileLatency(us), 83
[READ], 99thPercentileLatency(us), 115
[READ], Return=OK, 95069
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4658.0
[CLEANUP], MinLatency(us), 4656
[CLEANUP], MaxLatency(us), 4659
[CLEANUP], 95thPercentileLatency(us), 4659
[CLEANUP], 99thPercentileLatency(us), 4659
[UPDATE], Operations, 4931
[UPDATE], AverageLatency(us), 108.3423240721963
[UPDATE], MinLatency(us), 61
[UPDATE], MaxLatency(us), 3409
[UPDATE], 95thPercentileLatency(us), 152
[UPDATE], 99thPercentileLatency(us), 249
[UPDATE], Return=OK, 4931
total zerocopy send size = 0, total send size = 22735638, 0.000000
[OVERALL], RunTime(ms), 5642
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17724.211272598368
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95025
[READ], AverageLatency(us), 52.16972375690608
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 5559
[READ], 95thPercentileLatency(us), 85
[READ], 99thPercentileLatency(us), 117
[READ], Return=OK, 95025
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2327.0
[CLEANUP], MinLatency(us), 2326
[CLEANUP], MaxLatency(us), 2327
[CLEANUP], 95thPercentileLatency(us), 2327
[CLEANUP], 99thPercentileLatency(us), 2327
[UPDATE], Operations, 4975
[UPDATE], AverageLatency(us), 108.30170854271357
[UPDATE], MinLatency(us), 63
[UPDATE], MaxLatency(us), 560
[UPDATE], 95thPercentileLatency(us), 156
[UPDATE], 99thPercentileLatency(us), 256
[UPDATE], Return=OK, 4975
total zerocopy send size = 0, total send size = 22733526, 0.000000
[OVERALL], RunTime(ms), 5672
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17630.46544428773
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95030
[READ], AverageLatency(us), 52.399168683573606
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 5303
[READ], 95thPercentileLatency(us), 85
[READ], 99thPercentileLatency(us), 117
[READ], Return=OK, 95030
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3223.0
[CLEANUP], MinLatency(us), 3222
[CLEANUP], MaxLatency(us), 3223
[CLEANUP], 95thPercentileLatency(us), 3223
[CLEANUP], 99thPercentileLatency(us), 3223
[UPDATE], Operations, 4970
[UPDATE], AverageLatency(us), 108.25573440643863
[UPDATE], MinLatency(us), 60
[UPDATE], MaxLatency(us), 1869
[UPDATE], 95thPercentileLatency(us), 154
[UPDATE], 99thPercentileLatency(us), 230
[UPDATE], Return=OK, 4970
total zerocopy send size = 0, total send size = 22751686, 0.000000
total zerocopy send size = 0, total send size = 22799434, 0.000000
total zerocopy send size = 0, total send size = 22702483, 0.000000
[OVERALL], RunTime(ms), 5695
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17559.26251097454
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95021
[READ], AverageLatency(us), 52.66798918133886
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5519
[READ], 95thPercentileLatency(us), 84
[READ], 99thPercentileLatency(us), 116
[READ], Return=OK, 95021
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3873.0
[CLEANUP], MinLatency(us), 3872
[CLEANUP], MaxLatency(us), 3873
[CLEANUP], 95thPercentileLatency(us), 3873
[CLEANUP], 99thPercentileLatency(us), 3873
[UPDATE], Operations, 4979
[UPDATE], AverageLatency(us), 108.1040369552119
[UPDATE], MinLatency(us), 64
[UPDATE], MaxLatency(us), 577
[UPDATE], 95thPercentileLatency(us), 155
[UPDATE], 99thPercentileLatency(us), 246
[UPDATE], Return=OK, 4979
[OVERALL], RunTime(ms), 5684
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17593.244194229417
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 94964
[READ], AverageLatency(us), 52.56936312707973
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 100415
[READ], 95thPercentileLatency(us), 85
[READ], 99thPercentileLatency(us), 117
[READ], Return=OK, 94964
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1859.0
[CLEANUP], MinLatency(us), 1859
[CLEANUP], MaxLatency(us), 1859
[CLEANUP], 95thPercentileLatency(us), 1859
[CLEANUP], 99thPercentileLatency(us), 1859
[UPDATE], Operations, 5036
[UPDATE], AverageLatency(us), 107.32505957108816
[UPDATE], MinLatency(us), 59
[UPDATE], MaxLatency(us), 5619
[UPDATE], 95thPercentileLatency(us), 154
[UPDATE], 99thPercentileLatency(us), 236
[UPDATE], Return=OK, 5036
[OVERALL], RunTime(ms), 5699
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17546.93805930865
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95056
[READ], AverageLatency(us), 52.72884404982326
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5431
[READ], 95thPercentileLatency(us), 84
[READ], 99thPercentileLatency(us), 118
[READ], Return=OK, 95056
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1868.0
[CLEANUP], MinLatency(us), 1868
[CLEANUP], MaxLatency(us), 1868
[CLEANUP], 95thPercentileLatency(us), 1868
[CLEANUP], 99thPercentileLatency(us), 1868
[UPDATE], Operations, 4944
[UPDATE], AverageLatency(us), 108.72269417475728
[UPDATE], MinLatency(us), 65
[UPDATE], MaxLatency(us), 530
[UPDATE], 95thPercentileLatency(us), 154
[UPDATE], 99thPercentileLatency(us), 236
[UPDATE], Return=OK, 4944
total zerocopy send size = 0, total send size = 22662946, 0.000000
[OVERALL], RunTime(ms), 5715
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17497.812773403326
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95076
[READ], AverageLatency(us), 52.82458243931171
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 5343
[READ], 95thPercentileLatency(us), 86
[READ], 99thPercentileLatency(us), 119
[READ], Return=OK, 95076
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4206.0
[CLEANUP], MinLatency(us), 4204
[CLEANUP], MaxLatency(us), 4207
[CLEANUP], 95thPercentileLatency(us), 4207
[CLEANUP], 99thPercentileLatency(us), 4207
[UPDATE], Operations, 4924
[UPDATE], AverageLatency(us), 108.99715678310316
[UPDATE], MinLatency(us), 64
[UPDATE], MaxLatency(us), 866
[UPDATE], 95thPercentileLatency(us), 158
[UPDATE], 99thPercentileLatency(us), 241
[UPDATE], Return=OK, 4924
total zerocopy send size = 0, total send size = 22877672, 0.000000
total zerocopy send size = 0, total send size = 22673282, 0.000000
[OVERALL], RunTime(ms), 5784
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17289.073305670816
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 94924
[READ], AverageLatency(us), 53.43037587965109
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5215
[READ], 95thPercentileLatency(us), 85
[READ], 99thPercentileLatency(us), 117
[READ], Return=OK, 94924
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2099.0
[CLEANUP], MinLatency(us), 2098
[CLEANUP], MaxLatency(us), 2099
[CLEANUP], 95thPercentileLatency(us), 2099
[CLEANUP], 99thPercentileLatency(us), 2099
[UPDATE], Operations, 5076
[UPDATE], AverageLatency(us), 110.06343577620173
[UPDATE], MinLatency(us), 64
[UPDATE], MaxLatency(us), 573
[UPDATE], 95thPercentileLatency(us), 156
[UPDATE], 99thPercentileLatency(us), 244
[UPDATE], Return=OK, 5076
total zerocopy send size = 0, total send size = 22914032, 0.000000
[OVERALL], RunTime(ms), 5791
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17268.17475392851
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95068
[READ], AverageLatency(us), 53.66153700509109
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 5479
[READ], 95thPercentileLatency(us), 87
[READ], 99thPercentileLatency(us), 119
[READ], Return=OK, 95068
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2341.0
[CLEANUP], MinLatency(us), 2340
[CLEANUP], MaxLatency(us), 2341
[CLEANUP], 95thPercentileLatency(us), 2341
[CLEANUP], 99thPercentileLatency(us), 2341
[UPDATE], Operations, 4932
[UPDATE], AverageLatency(us), 109.6749797242498
[UPDATE], MinLatency(us), 61
[UPDATE], MaxLatency(us), 882
[UPDATE], 95thPercentileLatency(us), 158
[UPDATE], 99thPercentileLatency(us), 238
[UPDATE], Return=OK, 4932
[OVERALL], RunTime(ms), 5808
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17217.63085399449
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 94877
[READ], AverageLatency(us), 53.605942430726095
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5495
[READ], 95thPercentileLatency(us), 87
[READ], 99thPercentileLatency(us), 119
[READ], Return=OK, 94877
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2157.0
[CLEANUP], MinLatency(us), 2156
[CLEANUP], MaxLatency(us), 2157
[CLEANUP], 95thPercentileLatency(us), 2157
[CLEANUP], 99thPercentileLatency(us), 2157
[UPDATE], Operations, 5123
[UPDATE], AverageLatency(us), 110.57856724575444
[UPDATE], MinLatency(us), 64
[UPDATE], MaxLatency(us), 831
[UPDATE], 95thPercentileLatency(us), 162
[UPDATE], 99thPercentileLatency(us), 271
[UPDATE], Return=OK, 5123
total zerocopy send size = 0, total send size = 22800659, 0.000000
[OVERALL], RunTime(ms), 5841
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17120.35610340695
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 94988
[READ], AverageLatency(us), 54.06460816103087
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5211
[READ], 95thPercentileLatency(us), 87
[READ], 99thPercentileLatency(us), 120
[READ], Return=OK, 94988
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1869.0
[CLEANUP], MinLatency(us), 1869
[CLEANUP], MaxLatency(us), 1869
[CLEANUP], 95thPercentileLatency(us), 1869
[CLEANUP], 99thPercentileLatency(us), 1869
[UPDATE], Operations, 5012
[UPDATE], AverageLatency(us), 111.27593774940144
[UPDATE], MinLatency(us), 67
[UPDATE], MaxLatency(us), 1089
[UPDATE], 95thPercentileLatency(us), 161
[UPDATE], 99thPercentileLatency(us), 251
[UPDATE], Return=OK, 5012
total zerocopy send size = 0, total send size = 22551191, 0.000000
[OVERALL], RunTime(ms), 5852
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 17088.174982911823
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95175
[READ], AverageLatency(us), 54.2114841082217
[READ], MinLatency(us), 26
[READ], MaxLatency(us), 5375
[READ], 95thPercentileLatency(us), 87
[READ], 99thPercentileLatency(us), 120
[READ], Return=OK, 95175
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1861.0
[CLEANUP], MinLatency(us), 1861
[CLEANUP], MaxLatency(us), 1861
[CLEANUP], 95thPercentileLatency(us), 1861
[CLEANUP], 99thPercentileLatency(us), 1861
[UPDATE], Operations, 4825
[UPDATE], AverageLatency(us), 111.85284974093264
[UPDATE], MinLatency(us), 62
[UPDATE], MaxLatency(us), 1265
[UPDATE], 95thPercentileLatency(us), 159
[UPDATE], 99thPercentileLatency(us), 246
[UPDATE], Return=OK, 4825
total zerocopy send size = 0, total send size = 22698093, 0.000000
total zerocopy send size = 0, total send size = 22833849, 0.000000
[OVERALL], RunTime(ms), 5883
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16998.130205677375
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 94938
[READ], AverageLatency(us), 54.3490488529356
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 5363
[READ], 95thPercentileLatency(us), 87
[READ], 99thPercentileLatency(us), 119
[READ], Return=OK, 94938
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2179.0
[CLEANUP], MinLatency(us), 2178
[CLEANUP], MaxLatency(us), 2179
[CLEANUP], 95thPercentileLatency(us), 2179
[CLEANUP], 99thPercentileLatency(us), 2179
[UPDATE], Operations, 5062
[UPDATE], AverageLatency(us), 113.48952983010668
[UPDATE], MinLatency(us), 63
[UPDATE], MaxLatency(us), 552
[UPDATE], 95thPercentileLatency(us), 164
[UPDATE], 99thPercentileLatency(us), 242
[UPDATE], Return=OK, 5062
[OVERALL], RunTime(ms), 5885
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16992.35344095157
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95055
[READ], AverageLatency(us), 54.220588080584925
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 5539
[READ], 95thPercentileLatency(us), 87
[READ], 99thPercentileLatency(us), 120
[READ], Return=OK, 95055
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3091.0
[CLEANUP], MinLatency(us), 3090
[CLEANUP], MaxLatency(us), 3091
[CLEANUP], 95thPercentileLatency(us), 3091
[CLEANUP], 99thPercentileLatency(us), 3091
[UPDATE], Operations, 4945
[UPDATE], AverageLatency(us), 115.33083923154702
[UPDATE], MinLatency(us), 60
[UPDATE], MaxLatency(us), 3313
[UPDATE], 95thPercentileLatency(us), 169
[UPDATE], 99thPercentileLatency(us), 301
[UPDATE], Return=OK, 4945
total zerocopy send size = 0, total send size = 22740717, 0.000000
[OVERALL], RunTime(ms), 5932
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16857.720836142955
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 94990
[READ], AverageLatency(us), 54.865164754184654
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 5215
[READ], 95thPercentileLatency(us), 87
[READ], 99thPercentileLatency(us), 119
[READ], Return=OK, 94990
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2051.0
[CLEANUP], MinLatency(us), 2050
[CLEANUP], MaxLatency(us), 2051
[CLEANUP], 95thPercentileLatency(us), 2051
[CLEANUP], 99thPercentileLatency(us), 2051
[UPDATE], Operations, 5010
[UPDATE], AverageLatency(us), 113.25329341317365
[UPDATE], MinLatency(us), 56
[UPDATE], MaxLatency(us), 1725
[UPDATE], 95thPercentileLatency(us), 163
[UPDATE], 99thPercentileLatency(us), 251
[UPDATE], Return=OK, 5010
total zerocopy send size = 0, total send size = 22735587, 0.000000
[OVERALL], RunTime(ms), 6028
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 16589.250165892503
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 95015
[READ], AverageLatency(us), 55.742188075567014
[READ], MinLatency(us), 20
[READ], MaxLatency(us), 6251
[READ], 95thPercentileLatency(us), 91
[READ], 99thPercentileLatency(us), 125
[READ], Return=OK, 95015
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2455.0
[CLEANUP], MinLatency(us), 2454
[CLEANUP], MaxLatency(us), 2455
[CLEANUP], 95thPercentileLatency(us), 2455
[CLEANUP], 99thPercentileLatency(us), 2455
[UPDATE], Operations, 4985
[UPDATE], AverageLatency(us), 117.52497492477433
[UPDATE], MinLatency(us), 49
[UPDATE], MaxLatency(us), 719
[UPDATE], 95thPercentileLatency(us), 187
[UPDATE], 99thPercentileLatency(us), 308
[UPDATE], Return=OK, 4985